import { prisma } from "@/lib/db";
import { NextResponse } from "next/server";

export const POST = async () => {
  const response = await prisma.fact.create({
    data: {
      destination: "Singapore",
      description:
        "Сингапур улс нь Зүүн Өмнөд Азид орших жижигхэн боловч маш хөгжсөн хот-улс юм. Нутаг дэвсгэр багатай ч дэлхийн хамгийн цэвэр, аюулгүй, орчин үеийн хотуудын нэг гэдгээрээ алдартай. Энд англи хэл өргөн хэрэглэгддэг бөгөөд олон үндэстэн, соёл зэрэгцэн оршдог. Сингапур нь өндөр тэнгэр баганадсан барилга, ухаалаг хотын шийдэл, хатуу боловч үр дүнтэй хууль дүрмээрээ онцлог бөгөөд эдийн засаг, технологи, боловсролын төв болж чадсан улс юм>",
      currency: "Сингапур доллар (SGD)  1$ ≈ 1.29 сингапур доллар",
      visa: "30 хоногийн визтэй",
      language: "Англи, Малай, Хятад",
    },
  });
  return NextResponse.json(response);
};
